saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.EFM32GGxxx_DFP.2.5.0.pdsc
      <component Cgroup="Drivers" Csub="RetargetIo"     Cvariant="Serial" condition="BSP Driver RetargetIo Serial">
        <description>RetargetIo Driver (Serial)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_RETARGETIO_SERIAL
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__RetargetIo.html"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/retargetio.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/retargetserial.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/retargetserial.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RetargetIo"     Cvariant="Tft"    condition="BSP Driver RetargetIo Tft">
        <description>RetargetIo Driver (Tft)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_RETARGETIO_TFT
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__RetargetIo.html"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/retargetio.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/retargettft.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/retargettft.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Si114x"                           condition="BSP Driver Si114x">
        <description>Si114x Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_SI114X
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__Si114x.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/si1147_i2c.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/si1147_i2c.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/si114x_algorithm.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/si114x_algorithm.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/si114x_functions.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Si7013"                           condition="BSP Driver Si7013">
        <description>Si7013 Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_SI7013
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__Si7013.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/si7013.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/si7013.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="TempSensor"                       condition="BSP Driver TempSensor">
        <description>TempSensor Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_TEMPSENSOR
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__TempSensor.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/tempsens.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/tempsens.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Tft"            Cvariant="EBI"    condition="BSP Driver Tft EBI">
        <description>Tft Driver (EBI)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_TFT_EBI
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__Tft.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/tftamapped.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/tftamapped.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Tft"            Cvariant="RGB"    condition="BSP Driver Tft RGB">
        <description>Tft Driver (RGB)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_TFT_RGB
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__Tft.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/tftdirect.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/tftdirect.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/tftspi.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/tftspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch"                            condition="BSP Driver Touch">
        <description>Touch Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_TOUCH
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__Touch.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/touch.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/touch.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/calibrate.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Udelay"                           condition="BSP Driver Udelay">
        <description>Udelay Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_UDELAY
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__Udelay.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/udelay.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/udelay.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="VddCheck"                         condition="BSP Driver VddCheck">
        <description>VddCheck Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_VDDCHECK
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__VddCheck.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/vddcheck.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/vddcheck.c"/>
        </files>
      </component>

      <component Cgroup="A/D Converter" Capiversion="1.0.0"                      condition="EFM32GG BSP ADC">
        <description>A/D Converter interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/ADC_DK3750.c"/>
        </files>
      </component>
